MorseCode = {'a': '.-', 'b': '-...', 'c': '-.-.', 'd': '-..', 'e': '.', 'f': '..-.',
             'g': '--.', 'h': '....', 'i': '..', 'j': '.---',
             'k': '-.-', 'l': '.-..', 'm': '--', 'n': '-.',
             'o': '---', 'p': '.--.', 'q': '--.-',
             'r': '.-.', 's': '...', 't': '-', 'u': '..-', 'v': '...-', 'w': '.--', 'x': '-..-',
             'y': '-.--', 'z': '--..',
             '.': '.', '-': '-', '1': '.----', '2': '..---', '3': '...--', '4': '....-',
             '5': '.....',
             '6': '-....', '7': '--...', '8': '---..', '9': '----.', '0': '-----', ' ': ' '}

MorseCode_rev = {'.-': 'a', '-...': 'b', '-.-.': 'c', '-..': 'd', '.': 'e', '..-.': 'f',
                 '--.': 'g', '....': 'h', '..': 'i', '.---': 'j',
                 '-.-': 'k', '.-..': 'l', '--': 'm', '-.': 'n',
                 '---': 'o', '.--.': 'p', '--.-': 'q',
                 '.-.': 'r', '...': 's', '-': 't', '..-': 'u', '...-': 'v',
                 '-.--': 'y', '--..': 'z', '.--': 'w', 'x': '-..-',
                 '.----': '1', '..---': '2',
                 '.....': '5', '...--': '3', '....-': '4',
                 '-....': '6', '--...': '7', '— -..': '8', '----.': '9', '-----': '0', ' ': ' '}


def encode_to_morse(text):
    text = text.lower()
    ans = []
    for i in text:
        if i == ' ':
            continue
        else:
            ans.append(MorseCode[i])
    return ' '.join(ans)


def decode_from_morse(text):
    text = text.split()
    ans = []
    for i in text:
        ans.append(MorseCode_rev[i])
    return ''.join(ans)


def main():
    word = input()
    text = input()
    if word == 'кодирование':
        print(encode_to_morse(text))
    else:
        print(decode_from_morse(text))


print(decode_from_morse('.---- ..--- --. ..--- ..---'))
# print(encode_to_morse('    12 G22'))]
